apache/nuttx/arch/arm/src/efm32/efm32_usbhost.c
/* Register operations ******************************************************/

#ifdef CONFIG_EFM32_USBHOST_REGDEBUG
static void efm32_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void efm32_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t efm32_getreg(uint32_t addr);
static void efm32_putreg(uint32_t addr, uint32_t value);
#else
#  define efm32_getreg(addr)     getreg32(addr)
#  define efm32_putreg(addr,val) putreg32(val,addr)
#endif

static inline void efm32_modifyreg(uint32_t addr, uint32_t clrbits,
                                   uint32_t setbits);

#ifdef CONFIG_EFM32_USBHOST_PKTDUMP
#  define efm32_pktdump(m,b,n) lib_dumpbuffer(m,b,n)
#else
#  define efm32_pktdump(m,b,n)
#endif

/* Byte stream access helper functions **************************************/

static inline uint16_t efm32_getle16(const uint8_t *val);

/* Channel management *******************************************************/

static int efm32_chan_alloc(struct efm32_usbhost_s *priv);
static inline void efm32_chan_free(struct efm32_usbhost_s *priv,
                                   int chidx);
static inline void efm32_chan_freeall(struct efm32_usbhost_s *priv);
static void efm32_chan_configure(struct efm32_usbhost_s *priv,
                                 int chidx);
static void efm32_chan_halt(struct efm32_usbhost_s *priv, int chidx,
                            enum efm32_chreason_e chreason);
static int efm32_chan_waitsetup(struct efm32_usbhost_s *priv,
                                struct efm32_chan_s *chan);
#ifdef CONFIG_USBHOST_ASYNCH
static int efm32_chan_asynchsetup(struct efm32_usbhost_s *priv,
                                  struct efm32_chan_s *chan,
                                  usbhost_asynch_t callback, void *arg);
#endif
static int efm32_chan_wait(struct efm32_usbhost_s *priv,
                           struct efm32_chan_s *chan);
static void efm32_chan_wakeup(struct efm32_usbhost_s *priv,
                              struct efm32_chan_s *chan);
static int efm32_ctrlchan_alloc(struct efm32_usbhost_s *priv,
                                uint8_t epno, uint8_t funcaddr,
                                uint8_t speed,
                                struct efm32_ctrlinfo_s *ctrlep);
static int efm32_ctrlep_alloc(struct efm32_usbhost_s *priv,
                              const struct usbhost_epdesc_s *epdesc,
                              usbhost_ep_t *ep);
static int efm32_xfrep_alloc(struct efm32_usbhost_s *priv,
                             const struct usbhost_epdesc_s *epdesc,
                             usbhost_ep_t *ep);

/* Control/data transfer logic **********************************************/

static void efm32_transfer_start(struct efm32_usbhost_s *priv,
                                 int chidx);
#if 0 /* Not used */
static inline uint16_t efm32_getframe(void);
#endif
static int efm32_ctrl_sendsetup(struct efm32_usbhost_s *priv,
                                struct efm32_ctrlinfo_s *ep0,
                                const struct usb_ctrlreq_s *req);
static int efm32_ctrl_senddata(struct efm32_usbhost_s *priv,
                               struct efm32_ctrlinfo_s *ep0,
                               uint8_t *buffer, unsigned int buflen);
static int efm32_ctrl_recvdata(struct efm32_usbhost_s *priv,
                               struct efm32_ctrlinfo_s *ep0,
                               uint8_t *buffer, unsigned int buflen);
static int efm32_in_setup(struct efm32_usbhost_s *priv, int chidx);
static ssize_t efm32_in_transfer(struct efm32_usbhost_s *priv, int chidx,
                                 uint8_t *buffer, size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void efm32_in_next(struct efm32_usbhost_s *priv,
                          struct efm32_chan_s *chan);
static int efm32_in_asynch(struct efm32_usbhost_s *priv, int chidx,
                           uint8_t *buffer, size_t buflen,
                           usbhost_asynch_t callback, void *arg);
#endif
static int efm32_out_setup(struct efm32_usbhost_s *priv,
                           int chidx);
static ssize_t efm32_out_transfer(struct efm32_usbhost_s *priv,
                                  int chidx, uint8_t *buffer,
                                  size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void efm32_out_next(struct efm32_usbhost_s *priv,
                           struct efm32_chan_s *chan);
static int efm32_out_asynch(struct efm32_usbhost_s *priv, int chidx,
                            uint8_t *buffer, size_t buflen,
                            usbhost_asynch_t callback, void *arg);
#endif

/* Interrupt handling *******************************************************/

/* Lower level interrupt handlers */

static void efm32_gint_wrpacket(struct efm32_usbhost_s *priv,
                                uint8_t *buffer, int chidx, int buflen);
static inline void efm32_gint_hcinisr(struct efm32_usbhost_s *priv,
                                      int chidx);
static inline void efm32_gint_hcoutisr(struct efm32_usbhost_s *priv,
                                       int chidx);
static void efm32_gint_connected(struct efm32_usbhost_s *priv);
static void efm32_gint_disconnected(struct efm32_usbhost_s *priv);

/* Second level interrupt handlers */

#ifdef CONFIG_EFM32_OTGFS_SOFINTR
static inline void efm32_gint_sofisr(struct efm32_usbhost_s *priv);
#endif
static inline void efm32_gint_rxflvlisr(struct efm32_usbhost_s *priv);
static inline void efm32_gint_nptxfeisr(struct efm32_usbhost_s *priv);
static inline void efm32_gint_ptxfeisr(struct efm32_usbhost_s *priv);
static inline void efm32_gint_hcisr(struct efm32_usbhost_s *priv);
static inline void efm32_gint_hprtisr(struct efm32_usbhost_s *priv);
static inline void efm32_gint_discisr(struct efm32_usbhost_s *priv);
static inline void efm32_gint_ipxfrisr(struct efm32_usbhost_s *priv);

/* First level, global interrupt handler */

static int efm32_gint_isr(int irq, void *context, void *arg);

/* Interrupt controls */

static void efm32_gint_enable(void);
static void efm32_gint_disable(void);
static inline void efm32_hostinit_enable(void);
static void efm32_txfe_enable(struct efm32_usbhost_s *priv, int chidx);

/* USB host controller operations *******************************************/

static int efm32_wait(struct usbhost_connection_s *conn,
                      struct usbhost_hubport_s **hport);
static int efm32_rh_enumerate(struct efm32_usbhost_s *priv,
                              struct usbhost_connection_s *conn,
                              struct usbhost_hubport_s *hport);
static int efm32_enumerate(struct usbhost_connection_s *conn,
                           struct usbhost_hubport_s *hport);

